In [1]:
import pandas as pd

In [14]:
df=pd.read_csv("z:\marks.csv")

In [15]:
df

   rollno  subject1  subject2  subject3  subject4  subject5  subject6
0       1        99        89        99        89        79        99
1       2       100        90       100        80       100       100
2       3        89        89        99        89        79        89
3       4        87        87        97        87        77        97
4       5       100        90       100        70       100        90

In [16]:
df.head(3)

   rollno  subject1  subject2  subject3  subject4  subject5  subject6
0       1        99        89        99        89        79        99
1       2       100        90       100        80       100       100
2       3        89        89        99        89        79        89

In [25]:
df.drop('rollno',axis=1).describe()

         subject1   subject2    subject3   subject4    subject5    subject6
count    5.000000   5.000000    5.000000   5.000000    5.000000    5.000000
mean    95.000000  89.000000   99.000000  83.000000   87.000000   95.000000
std      6.442049   1.224745    1.224745   8.154753   11.895377    5.147815
min     87.000000  87.000000   97.000000  70.000000   77.000000   89.000000
25%     89.000000  89.000000   99.000000  80.000000   79.000000   90.000000
50%     99.000000  89.000000   99.000000  87.000000   79.000000   97.000000
75%    100.000000  90.000000  100.000000  89.000000  100.000000   99.000000
max    100.000000  90.000000  100.000000  89.000000  100.000000  100.000000

In [19]:
df[['subject1','subject2','subject3']].mean()

subject1    95.0
subject2    89.0
subject3    99.0
dtype: float64

In [20]:
df[['subject1','subject2','subject3']].median()

subject1    99.0
subject2    89.0
subject3    99.0
dtype: float64

In [24]:
df.iloc[:,1:].median()

subject1    99.0
subject2    89.0
subject3    99.0
subject4    87.0
subject5    79.0
subject6    97.0
dtype: float64

In [26]:
df.drop('rollno',axis=1).mean()

subject1    95.0
subject2    89.0
subject3    99.0
subject4    83.0
subject5    87.0
subject6    95.0
dtype: float64

In [27]:
df.drop('rollno',axis=1).var()

subject1     41.5
subject2      1.5
subject3      1.5
subject4     66.5
subject5    141.5
subject6     26.5
dtype: float64

In [28]:
df

   rollno  subject1  subject2  subject3  subject4  subject5  subject6
0       1        99        89        99        89        79        99
1       2       100        90       100        80       100       100
2       3        89        89        99        89        79        89
3       4        87        87        97        87        77        97
4       5       100        90       100        70       100        90

In [29]:
df.drop('rollno',axis=1).std()

subject1     6.442049
subject2     1.224745
subject3     1.224745
subject4     8.154753
subject5    11.895377
subject6     5.147815
dtype: float64

In [30]:
df['subject1']>df['subject2']

0     True
1     True
2    False
3    False
4     True
dtype: bool

In [35]:
df[df['subject3']<=df['subject6']]

   rollno  subject1  subject2  subject3  subject4  subject5  subject6
0       1        99        89        99        89        79        99
1       2       100        90       100        80       100       100
3       4        87        87        97        87        77        97

In [34]:
df['subject4']==df['subject5']

0    False
1    False
2    False
3    False
4    False
dtype: bool